Revit 2026 API

# BRepBuilderEdgeGeometry Methods

---

The BRepBuilderEdgeGeometry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Curve) | Construct BRepBuilderEdgeGeometry based on any Revit Curve, including Line and Arc. The curve will be simplified if possible. |
|  | Create(XYZ, XYZ) | Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

BRepBuilderEdgeGeometry Class

Autodesk.Revit.DB Namespace